cf/InformationRegisters/нсиСоответствиеПользователейИГруппПользователейБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>нсиСоответствиеПользователейИГруппПользователейБП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаПользователейБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиГруппыПользователейБП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/нсиСоответствиеПользователейИГруппПользователейБП/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ИспользоватьПоУмолчанию Тогда 
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.нсиСоответствиеПользователейИГруппПользователейБП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Пользователь", ТекущийОбъект.Пользователь);
		Блокировка.Заблокировать();
		
		Набор = РегистрыСведений.нсиСоответствиеПользователейИГруппПользователейБП.СоздатьНаборЗаписей();
		Набор.Отбор.Пользователь.Установить(ТекущийОбъект.Пользователь);
		Набор.Прочитать();
		Для Каждого Строка Из Набор Цикл 
			Если Строка.ГруппаПользователейБП <> ТекущийОбъект.ГруппаПользователейБП Тогда 
				Строка.ИспользоватьПоУмолчанию = Ложь;
			КонецЕсли;
		КонецЦикла;
		Набор.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗначениеКопирования") Тогда 
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда 
			Запись.ИспользоватьПоУмолчанию = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
